Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils.HasCertifiedStructuralSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if element has defined structural section parameters inside its family.
document:
The document that owns the family for beam, brace or structural column.
elementId:
ID of family symbol or family instance for beam, brace or structural column.
Returns:
Returns true if element has defined structural section parameters inside its family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils.GetStructuralElementDefinitionData(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData@)
Return structural element definition data.
Remarks:
This information is provided only for beams, braces and structural columns.
document:
The document that owns the beam, brace or structural column.
elementId:
ID of family instance for beam, brace or structural column.
data:
Structural element definition data.
Returns:
Success code is returned if StructuralElementDefinitionData was provided successfully, error code otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils.SetStructuralSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection)
Set structural section in element.
Remarks:
Only beams, braces and structural columns can have structural section associated with it.
document:
The document that owns the family for beam, brace or structural column.
familySymbolId:
ID of family symbol for beam, brace or structural column.
structuralSection:
Structural section with values that will be set.
Returns:
True is returned when requested shape with values was properly set. Return false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils.GetStructuralSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Return structural section from element.
Remarks:
Only beams, braces and structural columns can have structural section associated with it.
document:
The document that owns the family for beam, brace or structural column.
elementId:
ID of family symbol or family instance for beam, brace or structural column.
Returns:
Structural section returned if element have one.
For elements that do not have structural section or can not have structural section null will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionUtils
This class provides utilities related to Structural Section Properties.
Since:
2015